Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeFaceGraphic
The Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeFaceGraphic class is a Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphic for faces.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeFaceGraphic.#ctor(Tekla.BIM.Geometry.Face3,Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t,System.Boolean)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeFaceGraphic class.
face: The face of the graphic.
color: The color of the graphic.
drawLightingEffect: A value indicating whether to draw the lighting effect.
Throws System.ArgumentException: Thrown when the number of contour points is not between 3 and 99 or when the face is self-intersecting.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeFaceGraphic.Face
Gets the Tekla.BIM.Geometry.Face3 of the face graphic.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeFaceGraphic.Get(Tekla.BIM.Geometry.Face3,Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t,System.Boolean)
Gets a new instance of the Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeFaceGraphic class.
face: The face of the graphic.
color: The color of the graphic.
drawLightingEffect: A value indicating whether to draw the lighting effect.
Returns: A new instance of the Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeFaceGraphic.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeFaceGraphic.Draw(System.Int32,Tekla.BIM.DirectManipulation.Services.Graphics.IGraphicsViewInfo)
Draws the graphic.
identifier: The identifier to use when drawing the graphic.
view: The Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo describing the view to draw to.